# Цикл
# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

int_x = [2,4,6,8,2,1,6,8,5,3]
for x in int_x:
    x +=1 
    print(x)    